bench/results/20260917T195041Z-cursor/raw/heavy/api/c/round1/mix-r2000.wrk2.txt
Running 10s test @ http://127.0.0.1:18401
  1 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms  816.92us  26.10ms   89.10%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.50ms
 90.000%    1.85ms
 99.000%    2.40ms
 99.900%   13.04ms
 99.990%   24.45ms
 99.999%   26.11ms
100.000%   26.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.084     0.000000            1         1.00
       0.493     0.100000         1891         1.11
       0.674     0.200000         3777         1.25
       0.823     0.300000         5668         1.43
       0.969     0.400000         7553         1.67
       1.114     0.500000         9437         2.00
       1.187     0.550000        10368         2.22
       1.263     0.600000        11319         2.50
       1.339     0.650000        12252         2.86
       1.418     0.700000        13199         3.33
       1.505     0.750000        14144         4.00
       1.555     0.775000        14616         4.44
       1.607     0.800000        15084         5.00
       1.658     0.825000        15556         5.71
       1.717     0.850000        16026         6.67
       1.783     0.875000        16496         8.00
       1.819     0.887500        16735         8.89
       1.853     0.900000        16966        10.00
       1.893     0.912500        17202        11.43
       1.940     0.925000        17443        13.33
       1.986     0.937500        17672        16.00
       2.017     0.943750        17791        17.78
       2.046     0.950000        17908        20.00
       2.083     0.956250        18026        22.86
       2.125     0.962500        18143        26.67
       2.159     0.968750        18260        32.00
       2.179     0.971875        18321        35.56
       2.201     0.975000        18378        40.00
       2.229     0.978125        18438        45.71
       2.257     0.981250        18498        53.33
       2.303     0.984375        18555        64.00
       2.321     0.985938        18589        71.11
       2.343     0.987500        18615        80.00
       2.373     0.989062        18643        91.43
       2.413     0.990625        18674       106.67
       2.459     0.992188        18702       128.00
       2.493     0.992969        18717       142.22
       2.533     0.993750        18732       160.00
       2.587     0.994531        18746       182.86
       2.691     0.995313        18761       213.33
       2.845     0.996094        18776       256.00
       3.043     0.996484        18783       284.44
       4.071     0.996875        18791       320.00
       4.635     0.997266        18798       365.71
       5.995     0.997656        18805       426.67
       6.855     0.998047        18813       512.00
       7.223     0.998242        18816       568.89
       7.711     0.998437        18820       640.00
       9.327     0.998633        18824       731.43
      10.655     0.998828        18827       853.33
      13.335     0.999023        18831      1024.00
      15.439     0.999121        18833      1137.78
      16.895     0.999219        18835      1280.00
      17.279     0.999316        18837      1462.86
      17.599     0.999414        18838      1706.67
      17.935     0.999512        18840      2048.00
      18.271     0.999561        18841      2275.56
      18.511     0.999609        18842      2560.00
      18.527     0.999658        18843      2925.71
      18.959     0.999707        18844      3413.33
      19.759     0.999756        18845      4096.00
      19.759     0.999780        18845      4551.11
      24.111     0.999805        18846      5120.00
      24.111     0.999829        18846      5851.43
      24.447     0.999854        18847      6826.67
      24.447     0.999878        18847      8192.00
      24.447     0.999890        18847      9102.22
      24.719     0.999902        18848     10240.00
      24.719     0.999915        18848     11702.86
      24.719     0.999927        18848     13653.33
      24.719     0.999939        18848     16384.00
      24.719     0.999945        18848     18204.44
      26.111     0.999951        18849     20480.00
      26.111     1.000000        18849          inf
#[Mean    =        1.174, StdDeviation   =        0.817]
#[Max     =       26.096, Total count    =        18849]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18850 requests in 10.00s, 10.43MB read
Requests/sec:   1885.10
Transfer/sec:      1.04MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0