bench/results/20260917T195041Z-cursor/raw/heavy/api/c/round1/warmup.txt
Running 3s test @ http://127.0.0.1:18401
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.73ms    2.70ms  58.40ms   94.27%
    Req/Sec    26.44k     4.13k   28.88k    90.32%
  81520 requests in 3.10s, 41.38MB read
Requests/sec:  26313.50
Transfer/sec:     13.36MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0